OpenFoam3/ParaviewTests/1stMesh/system/blockMeshDict4
//Ben Juenger
//COE347 OF3

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
  (0.000000000000000 0.000000000000000 -0.050000000000000) // 0
  (0.600000000000000 0.000000000000000 -0.050000000000000) // 1
  (0.000000000000000 0.200000000000000 -0.050000000000000) // 2
  (0.600000000000000 0.200000000000000 -0.050000000000000) // 3
  (3.000000000000000 0.200000000000000 -0.050000000000000) // 4
  (0.000000000000000 1.000000000000000 -0.050000000000000) // 5
  (0.600000000000000 1.000000000000000 -0.050000000000000) // 6
  (3.000000000000000 1.000000000000000 -0.050000000000000) // 7
  (0.000000000000000 0.000000000000000 0.050000000000000) // 8
  (0.600000000000000 0.000000000000000 0.050000000000000) // 9
  (0.000000000000000 0.200000000000000 0.050000000000000) // 10
  (0.600000000000000 0.200000000000000 0.050000000000000) // 11
  (3.000000000000000 0.200000000000000 0.050000000000000) // 12
  (0.000000000000000 1.000000000000000 0.050000000000000) // 13
  (0.600000000000000 1.000000000000000 0.050000000000000) // 14
  (3.000000000000000 1.000000000000000 0.050000000000000) // 15
);

blocks
(
  hex (0 1 3 2 8 9 11 10)  (288 96 1) simpleGrading (1.000000 1.000000 1.000000) // 0

  hex (2 3 6 5 10 11 14 13)  (288 384 1) simpleGrading (1.000000 1.000000 1.000000) // 1

  hex (3 4 7 6 11 12 15 14)  (1152 384 1) simpleGrading (1.000000 1.000000 1.000000) // 2

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
            (2 10 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 7 15 12)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 9 8)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (1 3 11 9)
            (3 4 12 11)
        );
    }
);